Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/pre_school_education_and_childcare/early_start.html.txt.tmx
Source language: en
Languages: ga

source: The Early Start Programme is a one-year preventative intervention scheme offered in selected schools in designated disadvantaged areas
ga: Scéim sheachanta idirghabhála bliana a chuirtear ar fáil i scoileanna faoi leith atá i gceantair aitheanta faoi mhíbhuntáiste é an Clár Píolótach Túsluath Réamhscoile

source: The objective of the pre-school programme, which is managed, funded and evaluated by the Department of Education and Skills, is to tackle educational disadvantage by targeting children who are at risk of not reaching their potential within the school system
ga: Tá sé mar aidhm ag an gclár, atá á bhainistiú, á mhaoiniú agus á mheas ag an Roinn Oideachais agus Scileanna, dul i ngleic le míbhuntáiste san oideachas tré dhíriú isteach ar pháistí a bhfuil baol ann nach mbainfidh siad amach a gcumas taobh istigh den chóras scoile

source: Children must be aged more than 3 years 2 months and less than 4 years 7 months on the 1st day of September of the year in which they are enrolled
ga: Caithfidh leanaí bheith os cionn 3 bliain, 2 mhí agus faoi bhun 4 bhliain 7 mí ar an 1ú lá Meán Fómhair na bliana sin a mbeidh siad cláraithe

source: Children may either be enrolled in Early Start or in the Free Pre-school Year Scheme
ga: D’fhéadhfadh leanaí clárú le haghaidh Túsluath nó an Scéim Bliain Réamhscoile Saor in Aisce

source: Children are not eligible to be enrolled in both schemes at the same time
ga: Ní cháilíonn leanaí clárú le haghaidh an dá scéim ag an am céanna

source: The Early Start Pre-School Programme was introduced in 1994
ga: Cuireadh an Clár Túsluath Réamhscoile i bhfeidhm i mí Dheireadh Fómhair 1994

source: You can get a list of the schools in the Early Start Programme (pdf) on the Department of Education and Skills website
ga: Tá liosta scoil i gClár Túsluath Réamhscoile ar láithreáin gréasáin den Roinn Oideachais agus Scileanna

source: The aims of Early Start are:
ga: Tá sé mar aidhm ag Túsluath:

source: • To implement an educational programme that will enhance the overall development of young children and prevent school failure
ga: • Clár oideachais a chuir i bhfeidhm a chuirfidh le forbairt iomlán na bpáistí óga agus a dhéanfaidh teip ag an scoil a sheachaint

source: • To counteract the effects of social disadvantage
ga: • Bac a chur ar thionchair an mhíbhuntáiste shóisialta

source: The desired outcomes of Early Start are:
ga: Mar thoradh ar Thúsluath tá súil:

source: • That the children involved in the programme will develop confidence in their ability to learn
ga: • Go mbeidh muinín ina gcumas foghlama féin ag na páistí a ghlacann páirt sa chlár

source: • That the children involved in the programme will develop learning styles, which are led by motivated, organised and appropriately independent behaviour
ga: • Go ndéanfar forbairt ar stíleanna foghlama na bpáistí a ghlacann páirt sa chlár, stíleanna atá treoraithe ag iompar spreagtha, eagraithe agus neamhspléach cuí

source: • That the children involved in the programme will develop their language, cognition and social/personal skills to the extent that they will be able to easily adapt to school life in the future
ga: • Go ndéanfar forbairt ar theanga, fios agus scíleanna sóisialta/pearsanta na bpáistí a ghlacann páirt sa chlár sa chaoi go mbeidh siad in ann titim isteach go héasca leis an saol scoile sa todhchaí

source: • That the 'learning through play' approach used in the programme will be positive and enjoyable for the children involved
ga: • Go mbainfidh na páistí a ghlacann páirt tairbhe agus taithneamh as an gcur chuige "foghlaim tríd an spraoi" a chuirtear i bhfeidhm sa Chlár

source: • That the parents of participating children will become actively involved in their children's education
ga: • Go mbeidh páirt ghníomhach ag tuismitheoirí na bpáistí atá rannpháirteach sa chlár in oideachas a bpáistí

source: How Early Start operates
ga: An modh oibre atá ag Túsluath

source: Early Start pre-schools are accommodated in vacant classrooms in primary schools
ga: Déantar cóiríocht a sholáthar do bhunscoileanna an Túis Luaith i seomraí ranga folmha i mbunscoileanna

source: The teachers and childcare workers in Early Start are members of staff and are under the general supervision of the Board of Management and the principal teacher
ga: Comhaltaí foirne iad na múinteoirí agus na hoibrithe cúram leanaí i gclár an Túis Luaith agus bíonn siad faoi mhaoirsiú ginearálta an Bhoird Bhainistíochta agus an phríomhoide

source: Early Start is regarded as an integral part of the primary school and benefits from the managerial and administrative services of the school
ga: Caitear leis an Tús Luath mar chuid lárnach de bhunscoil agus baineann sé tairbhí ó sheirbhís bainistíochta agus riaracháin na scoile

source: A full unit caters for a total of 60 children and a half-unit caters for 30
ga: Bíonn gach lánionad ag freastal le 60 páiste agus bíonn gach leathionad ag freastal ar 30 páiste

source: Each teacher and childcare worker caters for 15 children between 09.00 and 11.30 and a different 15 from 12.00 to 14.30 each day
ga: Tá gach múinteoir agus oibrí cáilithe i gcúram páistí ag freastal le grúpa 15 leanbh ó 9.00 go dtí 11.30 rn agus ag freastal le grúpa 15 leanbh eile ó 12.00 go dtí 2.30 i ngach lá

source: A full Early Start unit is staffed by 2 trained teachers, 2 trained childcare workers and parent volunteers. A half-unit is staffed by one trained teacher and a trained childcare worker
ga: Tá gach ionad Túsluath dhá riaradh ag beirt mhúinteoir cáilithe bunscoile a bhfuil saineolas léirithe acu i dteagasc na naíonán agus beirt oibrí cáilithe i gcúram páistí

source: The board of management of the school where Early Start is established appoints the childcare workers and the principal of the school assigns the teachers to work in Early Start
ga: Tá leathionad dhá riaradh ag aon mhúinteoir cáilithe amháin agus aon oibrí cáilithe i gcúram páistí agus tuismitheoirí deonacha.Tá na hoibrithe cúram páistí ceaptha ag Bord Bainistíochta na scoile ina bhfuil Túsluath bunaithe agus sannann príomhoide na scoile múinteoirí chun oibriú i Túsluath

source: Parental involvement is also a key element in the Early Start project, both in everyday management and in the organisation of activities
ga: Is cuid mhór den togra Túsluath é rannpháirtíocht na dtuismitheoirí i mbainistíocht laethúil agus i reachtáil na n-imeachtaí

source: Working in conjunction with the school's Home School Community Liaison Co-ordinator, the Early Start staff encourage parents to take part in the centre's activities
ga: Oibríonn foireann Túsluath i gcomhair le Comhorndóir na scoile don teagmháil Bhaile leis an Scoil agus leis an bPobal chun tuismitheoirí a spreagadh le páirt a ghlacadh in imeachtaí an ionaid

source: A rota is agreed and parents take turns to spend time each week in the centre
ga: Déantar sceideal a réiteach agus caitheann na tuismitheoirí seal gach seachtain san ionad

source: The curriculum of the programme prioritises the four core areas of language, cognition and social and personal development
ga: Leagtar béim i gcuraclam an chláir ar ceithre phríomh réimse - is iad sin teanga, fios, forbairt shóisialta agus forbairt phearsanta

source: This is done by engaging the children in structured play activities, aimed at enhancing their development in the core areas
ga: Déantar an páiste a chur ag plé le himeachtaí spraoi comhdhéanta atá dírithe ar fhorbairt an pháiste sna príomh réimsí sin

source: Within these play activities, teachers set specific learning objectives for each child
ga: Leagann múinteoirí síos aidhmeanna faoi leith foghlama do gach páiste taobh istigh de na himeachtaí spraoi seo

source: Play and positive adult-child interaction are the cornerstones of the Early Start activities
ga: Is iad an spraoi agus idirghníomhaíocht dearfach idir an duine fásta agus an páiste bunchlocha na n-imeachtaí Túsluath

source: After completing the Early Start programme, children proceed to the junior infants class
ga: Nuair atá an clár Túsluath curtha i gcrích ag na páistí téann siad ar aghaidh chuig rang na Naíonán Sóisearach ina mbunscoil

source: The teachers are fully qualified primary school teachers
ga: Múinteoirí láncháilithe bunscoile iad na múinteoirí

source: The minimum qualification for childcare workers in Early Start is a one-year full-time QQI (replaces FETAC) Level 5 qualification in Childcare, Pre-school Childcare or Social Care or equivalent
ga: Is í an cháilíocht íosta le haghaidh oibrithe cúram leanaí i gclár an Túis Luaith cáilíocht Leibhéal 5 Dhearbhú Cáilíochta agus Cáilíochtaí Éireann (QQI) (a tháinig in ionad FETAC) i gCúram Leanaí, Cúram Réamhscoile nó Cúram Sóisialta nó a chomhionann

source: Grants available under the Early Start scheme
ga: Deontais atá ar fáil faoin Scéim Túsluath

source: The following full and half-unit grants are provided by the Department of Education and Skills for schools participating in the Early Start scheme:
ga: Cuireann an Roinn Oideachais agus Scileanna na deontais seo a leanas ar fáil do scoileanna gur mian leo páirt a ghlacadh sa scéim Túsluath:

source: • €2,539.48 (full) €1,523.69 (half) per centre per annum for the purchase of materials/equipment
ga: • €2,539.48 (iomlán) €1,523.69 (leath) don ionad sa bhliain le ábhar/trealamh a cheannach

source: • €1,904.60 (full) €952.30 (half) per centre per annum for the development of parental involvement
ga: • €1,904.60 (iomlán) €952.30 (leath) don ionad sa bhliain le forbairt a dhéanamh ar rannpháirtíocht na dtuismitheoirí

source: In addition, an annual capitation grant of €95.23 per pupil is paid to the school's Board of Management, which is to be used as funding support for day-to-day running costs of the centre
ga: €95.23 sa bhliain ar gach páiste mar dheontas do Bhord Bainistíochta na scoile gur féidir a úsáid mar airgeadas tacaíochta do na costais reatha laethúla a bhíonn ag an ionad. Cá háit a ndéanfaidh mé iarratas?
